/*******************************************************************************
Copyright (c) 2014,重庆山外山科技有限公司技术中心
All rights reserved.
文件：    powerboardtypes.h
作者：    ccy
版本：    V1.0
日期：    2014-02-11
摘要：    定义485协议中电源模块数据结构********************************************************************************/
#ifndef POWERBOARDPROTOCOL_H
#define POWERBOARDPROTOCOL_H
#include <QtGlobal>

#ifdef Q_OS_WIN
    #pragma pack(1) /*Windows下MinGW编译，__attribute__((packed))没有效果*/
#endif

/***************************************************************************
*   下行命令WR0 (电源控制及定时开机命令)—16 字节
****************************************************************************/
//POWER_CMD/////////////////////////////////////////////////////
#define PB_WR0_OFF_ON           (1 << 0)     //  0/1—电源关机/开机

struct PB_WR0
{
    unsigned char    cmd;

}__attribute__((packed));


/***************************************************************************
*  电源驱动模块WR8（复位重启命令）-0字节
****************************************************************************/

/***************************************************************************
*  电源驱动模块WR9（升级命令信息）-1026字节
****************************************************************************/
struct PB_WR9
{
    unsigned char data_sum;     //APP数据帧总量
    unsigned char data_num;    //当前数据帧编号
    unsigned char data_value[1024];    //数据值，APP程序代码
}__attribute__((packed));



/***************************************************************************
*   上行信息 RD0（电源运行参数）—9 字节
****************************************************************************/
#define  PB_RD0_ET_FAI          (1 << 4)           //1-电源故障；0-电源正常
#define  PB_RD0_BRUN_BOVER      (1 << 3)           //1-电池充电中；0-充电完成
#define  PB_RD0_BN_BO           (1 << 2)           //1-电池异常；0-电池正常
#define  PB_RD0_CPN_CPO         (1 << 1)           //1-市电异常；0-市电正常
#define  PB_RD0_PS_CPS          (1 << 0)           //1-电池供电；0-市电供电

struct PB_RD0
{
    unsigned char   st;                  //电源状态
    unsigned short  voItage;             //市电电压
    unsigned char   battery;             //电池电量百分比
    unsigned char   twelveV;             //电源12V输出实际电压，精确到0.1
    unsigned short  twentyfourV;         //电源24V输出实际电压，精确到0.1
    unsigned short  battery_VoItage;     //电池电压，精确到0.1V
}__attribute__((packed));

/***************************************************************************
*  上行信息 RD7（软硬件版本信息）—6字节
****************************************************************************/
struct PB_RD7
{
    unsigned short  id;             //部件标识码
    unsigned short  hv;             //硬件版本(压缩BCD码)
    unsigned short  sv;             //软件版本(压缩BCD码)
}__attribute__((packed));



/***************************************************************************
*   电源驱动模块RD8（软硬件版本信息）-6字节
****************************************************************************/
struct PB_RD8
{
    unsigned char next_num;    //发送对应数据帧
    unsigned char write_sum;    //已写入数据量
    unsigned char iap_sv;         //升级程序 软件版本
}__attribute__((packed));

#ifdef Q_OS_WIN
    #pragma pack(0) /*恢复结构体对齐，以免影响到其他地方*/
#endif

#endif //POWERBOARDPROTOCOL_H



