#ifndef UREASENSORTYPES_H
#define UREASENSORTYPES_H
#include <QtGlobal>

#ifdef Q_OS_WIN
    #pragma pack(1) /*Windows下MinGW编译，__attribute__((packed))没有效果*/
#endif

/***************************************************************************
*   实时清除率监测模块WR0 (实时清除率检测模块控制命令)—6 字节
****************************************************************************/
#define US_WR0_CS    (1 << 1)        //0/1-不执行校正/零点校正
#define US_WR0_SR    (1 << 0)        //0/1-停止/开始检测

struct US_WR0
{
    quint8 cmd;
    quint8 nouse; //预留
    quint16 scan_time; //检测间隔(s)
    quint16 nouse_1; //预留
}__attribute__((packed));

/***************************************************************************
*   实时清除率监测模块WR8 (复位重启命令)—0 字节
****************************************************************************/


/***************************************************************************
*   实时清除率监测模块WR9 (升级命令信息)—1026 字节
****************************************************************************/
struct US_WR9
{
    quint8 data_sum;     //APP数据帧总量
    quint8 data_num;    //当前数据帧编号
    quint8 data_value[1024];    //数据值，APP程序代码
}__attribute__((packed));



/***************************************************************************
*   实时清除率监测模块RD0 (实时清除率检测模块数据)18 字节
****************************************************************************/
#define US_RD0_CT  (1 << 2)     //0/1-传感器未校正/已校正
#define US_RD0_ST  (1 << 1)     //0/1-传感器正常/异常
#define US_RD0_SR  (1 << 0)     //0/1-停止/正在检测

struct US_RD0
{
    quint8  st;   //实时清除率检测模块状态
    quint8  nouse; //预留
    quint16 abs;  //吸光度，放大100倍，单位mmol/L
    quint16 nouse_1; //预留
    quint32 i_ad;   //辐照光强度接收传感器AD值
    quint32 i0_ad;  //通过液体后关强度接收传感器AD值
    quint32 nouse_2; //预留
}__attribute__((packed));

/***************************************************************************
*   实时清除率监测模块RD7 (软硬件版本信息)—6 字节
****************************************************************************/
struct US_RD7
{
    quint16   id;       //实时清除率监测模块 部件标识码
    quint16   hv;       //实时清除率监测模块 硬件版本
    quint16   sv ;      //实时清除率监测模块 软件版本
}__attribute__((packed));

/***************************************************************************
*   实时清除率监测模块RD8（软硬件版本信息）-3字节
****************************************************************************/
struct US_RD8
{
    quint8 next_num;    //发送对应数据帧
    quint8 write_sum;   //已写入数据量
    quint8 iap_sv;      //升级程序 软件版本
}__attribute__((packed));

#ifdef Q_OS_WIN
    #pragma pack(0)     //恢复结构体对齐，以免影响到其他地方
#endif

#endif // UREASENSORTYPES_H
